In [ ]:
"""
Rising Temperature

Table: Weather
+---------------+---------+
| Column Name   | Type    |
+---------------+---------+
| id            | int     |
| recordDate    | date    |
| temperature   | int     |
+---------------+---------+
id is the primary key for this table.
This table contains information about the temperature in a certain day.
 

Write an SQL query to find all dates' id with higher temperature compared to its previous dates (yesterday).

Return the result table in any order.
"""

In [ ]:
"""testcase"""
{"headers": {"Weather": ["Id", "RecordDate", "Temperature"]}, 
 "rows": {"Weather": [[1, "2014-12-31", 10], [2, "2015-01-01", 25], [3, "2015-01-03", 20], [4, "2015-01-04", 30]]}}

In [ ]:
"""SQL table creation and data insertion"""
DROP TABLE IF EXISTS Weather;

CREATE TABLE Weather(
id int(4) NOT NULL,
recordDate DATE NOT NULL,
temperature int(4) NOT NULL,
PRIMARY KEY ('id'));

INSERT INTO Weather VALUES
(1, "2014-12-31", 10),
(2, "2015-01-01", 25),
(3, "2015-01-03", 20),
(4, "2015-01-04", 30);

In [ ]:
"""SQL solution"""
# 1 298 ms
SELECT a.id
FROM Weather AS a
INNER JOIN Weather AS b
ON DATE_SUB(a.recordDate, INTERVAL 1 DAY) = b.recordDate
AND a.Temperature > b.Temperature

# 2 329 ms
SELECT a.id
FROM Weather AS a
INNER JOIN Weather AS b
ON TO_DAYS(a.recordDate) - 1 = TO_DAYS(b.recordDate)
AND a.Temperature > b.Temperature

# 3 467 ms
SELECT a.id
FROM Weather AS a
INNER JOIN Weather AS b
ON DATEDIFF(a.recordDate, b.recordDate) = 1
AND a.Temperature > b.Temperature

# a.recordDate - 1 = b.recordDate wont' work
# because '2014-12-31' + 1 => 20141232 not 20150101 !!!

In [30]:
"""pandas dataframe creation"""
import pandas as pd

w = [(1, "2014-12-31", 10),
(2, "2015-01-01", 25),
(3, "2015-01-04", 20),
(4, "2015-01-05", 30),]

Weather = pd.DataFrame(w, columns=['id', 'recordDate', 'temperature'])
Weather.recordDate = pd.to_datetime(Weather['recordDate'])
Weather.head()

   id recordDate  temperature
0   1 2014-12-31           10
1   2 2015-01-01           25
2   3 2015-01-04           20
3   4 2015-01-05           30

In [31]:
Weather2 = Weather.copy()
Weather2['recordDate'] = Weather2['recordDate'] + pd.DateOffset(1)
Weather2

   id recordDate  temperature
0   1 2015-01-01           10
1   2 2015-01-02           25
2   3 2015-01-05           20
3   4 2015-01-06           30

In [32]:
df = pd.merge(Weather, Weather2, on='recordDate', suffixes=['_today', '_yesterday'])
df[df['temperature_today'] > df['temperature_yesterday']]['id_today']

0    2
1    4
Name: id_today, dtype: int64